<a href="https://colab.research.google.com/github/vikasmahajan90/ML-29th/blob/master/Data_Cleaning.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [26]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [55]:
# Fill in these missing numbers increase by 10 with each row so 10055 and 10075 need to be put inplace. 
newIndex = np.arange(1,df.From_To.count()+1)
df.set_index(newIndex,inplace=True)

for i in range(1,len(df["FlightNumber"])+1):
    df["FlightNumber"][i]= (df["FlightNumber"][i-1]+10) if (pd.isnull(df["FlightNumber"][i])) else df["FlightNumber"][i]
df

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

            From_To  FlightNumber  RecentDelays              Airline
1      LoNDon_paris       10045.0      [23, 47]               KLM(!)
2      MAdrid_miLAN       10055.0            []    <Air France> (12)
3  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
4    Budapest_PaRis       10075.0          [13]       12. Air France
5   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [56]:
# make the column an integer column (instead of a float column).
df.FlightNumber=df.FlightNumber.astype("int")
df.dtypes

From_To         object
FlightNumber     int64
RecentDelays    object
Airline         object
dtype: object

In [63]:
# From_To column would be better as two separate columns! Split each
# string on the underscore delimiter _ to give a new temporary DataFrame with
# the correct values. Assign the correct column names to this temporary DataFrame.
df_temp=df.copy()
df_temp[['From','To']] =df_temp.From_To.str.split('_',expand=True)
df_temp

            From_To  FlightNumber  ...      From         To
1      LoNDon_paris         10045  ...    LoNDon      paris
2      MAdrid_miLAN         10055  ...    MAdrid      miLAN
3  londON_StockhOlm         10065  ...    londON  StockhOlm
4    Budapest_PaRis         10075  ...  Budapest      PaRis
5   Brussels_londOn         10085  ...  Brussels     londOn

[5 rows x 6 columns]

In [67]:
# Notice how the capitalisation of the city names is all mixed up in this
# temporary DataFrame. Standardise the strings so that only the first letter is
# uppercase (e.g. "londON" should become "London".)
df_temp.From=df_temp.From.str.capitalize()
df_temp.To=df_temp.To.str.capitalize()
df_temp.From_To=df_temp.From_To.str.capitalize()
df_temp

            From_To  FlightNumber  ...      From         To
1      London_paris         10045  ...    London      Paris
2      Madrid_milan         10055  ...    Madrid      Milan
3  London_stockholm         10065  ...    London  Stockholm
4    Budapest_paris         10075  ...  Budapest      Paris
5   Brussels_london         10085  ...  Brussels     London

[5 rows x 6 columns]

In [77]:
# Delete the From_To column from df and attach the temporary DataFrame
# from the previous questions.
del df_temp["From_To"]
df_temp

   FlightNumber  RecentDelays              Airline      From         To
1         10045      [23, 47]               KLM(!)    London      Paris
2         10055            []    <Air France> (12)    Madrid      Milan
3         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
4         10075          [13]       12. Air France  Budapest      Paris
5         10085      [67, 32]          "Swiss Air"  Brussels     London

In [74]:
# In the RecentDelays column, the values have been entered into the
# DataFrame as a list. We would like each first value in its own column, each

# second value in its own column, and so on. If there isn't an Nth value, the value
# should be NaN.Expand the Series of lists into a DataFrame named delays, rename the columns
# delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.
pd.DataFrame(df["RecentDelays"].values.tolist())

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN